{
  "compliment": {
    "1": "You have the impressive talent of making things better just by showing up.",
    "2": "You are proof that common sense is not actually that common.",
    "3": "You somehow manage to be both cool and approachable, which is rare.",
    "4": "You give off strong 'knows what they are doing' energy.",
    "5": "You are surprisingly good at whatever you pretend to understand.",
    "6": "You make smart decisions more often than you realize.",
    "7": "You have the kind of confidence that feels earned.",
    "8": "You make complicated things feel less intimidating.",
    "9": "You are way more capable than you give yourself credit for.",
    "10": "You have a solid vibe that people trust instinctively.",
    "11": "You are oddly good at adapting when things go sideways.",
    "12": "You manage to stand out without trying too hard.",
    "13": "You are the type of person people are glad they listened to.",
    "14": "You have a quiet competence that speaks for itself.",
    "15": "You make progress even when you think you are stuck.",
    "16": "You have an underrated sense of humor.",
    "17": "You are better at this than you were yesterday, and it shows.",
    "18": "You have the rare skill of learning from mistakes.",
    "19": "You bring calm energy into chaotic situations.",
    "20": "You make effort look natural.",
    "21": "You are refreshingly genuine.",
    "22": "You have a good instinct for what actually matters.",
    "23": "You make people feel included without forcing it.",
    "24": "You are surprisingly reliable.",
    "25": "You handle responsibility better than most.",
    "26": "You have the patience of someone who knows they will succeed eventually.",
    "27": "You have strong main-character potential.",
    "28": "You think more clearly than you realize.",
    "29": "You have a good balance of logic and intuition.",
    "30": "You are good at figuring things out as you go.",
    "31": "You make consistency look easy.",
    "32": "You have a natural problem-solver mindset.",
    "33": "You are more observant than people expect.",
    "34": "You make solid choices under pressure.",
    "35": "You are the kind of person progress likes to follow.",
    "36": "You bring a steady confidence to the table.",
    "37": "You know when to push and when to pause.",
    "38": "You are quietly impressive.",
    "39": "You have strong potential written all over you.",
    "40": "You are good at turning effort into results.",
    "41": "You have a smart way of approaching challenges.",
    "42": "You are more disciplined than you think.",
    "43": "You make learning look natural.",
    "44": "You have good instincts and better follow-through.",
    "45": "You are dependable in ways that matter.",
    "46": "You have a strong sense of direction.",
    "47": "You manage to stay grounded even when things get messy.",
    "48": "You are good at making things work.",
    "49": "You bring value without needing attention.",
    "50": "You are doing better than you think.",
    "51": "You have an impressive ability to stay focused.",
    "52": "You are better prepared than most people around you.",
    "53": "You think things through instead of rushing.",
    "54": "You have a calm confidence that works.",
    "55": "You are good at building momentum.",
    "56": "You have a strong sense of self-control.",
    "57": "You are more capable than you let on.",
    "58": "You have a knack for figuring out what works.",
    "59": "You bring clarity where others bring noise.",
    "60": "You have a steady and reliable presence.",
    "61": "You make good use of your strengths.",
    "62": "You are good at staying consistent.",
    "63": "You have a sharp mind when you focus.",
    "64": "You approach problems thoughtfully.",
    "65": "You are good at learning from experience.",
    "66": "You have strong follow-through energy.",
    "67": "You manage complexity better than most.",
    "68": "You bring a practical kind of intelligence.",
    "69": "You have a quiet but solid confidence.",
    "70": "You know how to improve step by step.",
    "71": "You are better at this than you were last time.",
    "72": "You have a good sense of timing.",
    "73": "You are capable of more than you expect.",
    "74": "You make smart adjustments.",
    "75": "You have a surprisingly sharp perspective.",
    "76": "You keep moving forward even when it is slow.",
    "77": "You bring steady improvement wherever you go.",
    "78": "You are reliable when it counts.",
    "79": "You have a strong learning curve.",
    "80": "You are good at staying on track.",
    "81": "You handle challenges with patience.",
    "82": "You make thoughtful decisions.",
    "83": "You have a good balance of confidence and caution.",
    "84": "You stay calm under pressure.",
    "85": "You know how to build progress.",
    "86": "You have a good sense of judgment.",
    "87": "You are quietly effective.",
    "88": "You have a strong foundation to build on.",
    "89": "You make things work more often than not.",
    "90": "You bring stability into situations.",
    "91": "You are good at refining your approach.",
    "92": "You handle setbacks maturely.",
    "93": "You have a practical kind of wisdom.",
    "94": "You are steadily improving.",
    "95": "You make good use of your time.",
    "96": "You are more skilled than you think.",
    "97": "You have a reliable problem-solving style.",
    "98": "You are good at adapting.",
    "99": "You bring consistency and effort.",
    "100": "You are doing solid work, whether you notice it or not."
  },
  "insult": {
    "1": "You have the confidence of someone who did not read the instructions.",
    "2": "You are not wrong often, but when you are, you commit fully.",
    "3": "You think fast, just not always in the right direction.",
    "4": "You have a unique talent for overthinking simple things.",
    "5": "You bring enthusiasm before accuracy.",
    "6": "You are living proof that guessing is a strategy.",
    "7": "You have the energy of someone who almost gets it.",
    "8": "You try your best, and that is doing a lot of work.",
    "9": "You make bold choices with questionable planning.",
    "10": "You have strong opinions for someone who just learned this.",
    "11": "You are confidently incorrect in a very charming way.",
    "12": "You approach problems like a mystery novel, slowly.",
    "13": "You have the timing of someone slightly out of sync.",
    "14": "You think outside the box, mostly because you lost the box.",
    "15": "You are surprisingly committed to the wrong idea.",
    "16": "You bring chaos with good intentions.",
    "17": "You have the focus of someone multitasking unsuccessfully.",
    "18": "You are ambitious, accuracy optional.",
    "19": "You make things harder than they need to be.",
    "20": "You run on confidence more than information.",
    "21": "You have a habit of learning the hard way.",
    "22": "You are impressively inconsistent.",
    "23": "You bring creative solutions that almost work.",
    "24": "You seem surprised by predictable outcomes.",
    "25": "You have a strong talent for missing obvious details.",
    "26": "You are determined, even when wrong.",
    "27": "You approach clarity cautiously.",
    "28": "You have the patience of someone who forgets what they were doing.",
    "29": "You are a few steps ahead, just on the wrong path.",
    "30": "You bring confidence before confirmation.",
    "31": "You have a relaxed relationship with accuracy.",
    "32": "You are bold, but planning is not invited.",
    "33": "You have the attention span of a loading bar.",
    "34": "You tend to learn by trial, error, and more error.",
    "35": "You make assumptions with enthusiasm.",
    "36": "You have ideas, execution pending.",
    "37": "You are consistent at being slightly off.",
    "38": "You bring effort, direction unclear.",
    "39": "You are optimistic to a fault.",
    "40": "You think big, details not included.",
    "41": "You approach solutions experimentally.",
    "42": "You have confidence that outruns preparation.",
    "43": "You are good at starting, finishing is optional.",
    "44": "You have a creative interpretation of instructions.",
    "45": "You are confidently unsure.",
    "46": "You bring enthusiasm without a map.",
    "47": "You commit to ideas before thinking them through.",
    "48": "You make learning a scenic route.",
    "49": "You have the discipline of a flexible plan.",
    "50": "You are brave enough to guess publicly.",
    "51": "You approach logic creatively.",
    "52": "You have a loose grip on consistency.",
    "53": "You bring energy, results pending.",
    "54": "You are good at improvising, even when unnecessary.",
    "55": "You have the confidence of someone who skipped the tutorial.",
    "56": "You are ambitious but occasionally misinformed.",
    "57": "You approach planning optimistically.",
    "58": "You make progress sideways.",
    "59": "You are excellent at almost finishing.",
    "60": "You have ideas that need supervision.",
    "61": "You are determined to figure it out eventually.",
    "62": "You treat details as optional suggestions.",
    "63": "You have a bold approach to uncertainty.",
    "64": "You think fast, double-checking later.",
    "65": "You bring creativity where precision was requested.",
    "66": "You are strong on confidence, light on confirmation.",
    "67": "You make learning entertaining.",
    "68": "You approach structure casually.",
    "69": "You are impressively unbothered by mistakes.",
    "70": "You treat planning as a guideline.",
    "71": "You are brave enough to wing it.",
    "72": "You bring solutions that need refinement.",
    "73": "You have a talent for creative detours.",
    "74": "You make trial and error look intentional.",
    "75": "You are confident with minimal evidence.",
    "76": "You approach accuracy optimistically.",
    "77": "You have a flexible definition of correct.",
    "78": "You are determined, direction pending.",
    "79": "You bring bold guesses to the table.",
    "80": "You have ideas that arrive before logic.",
    "81": "You are consistently experimental.",
    "82": "You approach clarity eventually.",
    "83": "You are confident in unfinished thoughts.",
    "84": "You treat instructions as optional reading.",
    "85": "You have the courage to be wrong out loud.",
    "86": "You make progress in unexpected ways.",
    "87": "You are confidently learning in public.",
    "88": "You have enthusiasm that outruns precision.",
    "89": "You approach solutions creatively first.",
    "90": "You are good at guessing under pressure.",
    "91": "You bring optimism to uncertainty.",
    "92": "You have a relaxed relationship with planning.",
    "93": "You think first, verify later.",
    "94": "You approach problems experimentally.",
    "95": "You are bold with incomplete information.",
    "96": "You bring energy, logic catching up.",
    "97": "You are brave enough to try.",
    "98": "You have confidence that needs backup.",
    "99": "You are learning, loudly.",
    "100": "You are a work in progress, emphasis on progress."
  }
}
